In [1]:
import pandas as pd

In [2]:
chicago = pd.read_csv('chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')

In [3]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 1.0+ MB

In [4]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [5]:
chicago['Department'].nunique()

35

In [6]:
chicago['Department'].count()

32062

### Common String Methods

In [7]:
'HELLO WORLD'.lower()

'hello world'

In [8]:
'hello world'.upper()

'HELLO WORLD'

In [9]:
'hello world'.title()

'Hello World'

In [10]:
len("Hello World")

11

In [11]:
chicago['Name']=chicago['Name'].str.title()
chicago['Position Title']=chicago['Position Title'].str.title()

In [12]:
chicago['Department'].str.len()

0        11
1         6
2         6
3        16
4        11
5        12
6        13
7         4
8        12
9         8
10        4
11        6
12       16
13        6
14        4
15        6
16        6
17        4
18        6
19        4
20       11
21        4
22        4
23        4
24       16
25       11
26       13
27       16
28        6
29        4
         ..
32032    16
32033     6
32034     6
32035     6
32036    13
32037     4
32038    11
32039     4
32040     6
32041     4
32042    16
32043    13
32044     6
32045     4
32046     7
32047     6
32048     3
32049     4
32050    11
32051     8
32052     6
32053     4
32054     6
32055     6
32056    16
32057    16
32058     6
32059     6
32060     6
32061     4
Name: Department, Length: 32062, dtype: int64

### The .str.replace() Method

In [13]:
'hello World'.replace("h","H")

'Hello World'

In [14]:
chicago['Department']=chicago['Department'].str.replace('MGMNT','Management')
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER Management,$90744.00
1,"Aaron, Jeffery M",Police Officer,POLICE,$84450.00
2,"Aaron, Karina",Police Officer,POLICE,$84450.00
3,"Aaron, Kimberlei R",Chief Contract Expediter,GENERAL SERVICES,$89880.00
4,"Abad Jr, Vicente M",Civil Engineer Iv,WATER Management,$106836.00

In [15]:
chicago['Employee Annual Salary']=chicago['Employee Annual Salary'].str.replace("$","").astype(float)

In [16]:
chicago['Employee Annual Salary'].sum()

2571506375.3600698

In [17]:
chicago['Employee Annual Salary'].mean()

80204.178633899

In [18]:
chicago['Employee Annual Salary'].std()

25098.329867510587

In [19]:
chicago['Employee Annual Salary'].nlargest(1)

8184    300000.0
Name: Employee Annual Salary, dtype: float64

In [20]:
chicago['Employee Annual Salary'].nsmallest(1)

15102    0.96
Name: Employee Annual Salary, dtype: float64

### Filtering with String Methods

In [21]:
water = chicago['Position Title'].str.lower().str.contains("water")
chicago[water].head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER Management,90744.0
554,"Aluise, Vincent G",Foreman Of Water Pipe Construction,WATER Management,102440.0
671,"Ander, Perry A",Water Chemist Ii,WATER Management,82044.0
685,"Anderson, Andrew J",District Superintendent Of Water Distribution,WATER Management,109272.0
702,"Anderson, Donald",Foreman Of Water Pipe Construction,WATER Management,102440.0

In [22]:
startswithwater=chicago['Position Title'].str.lower().str.startswith('water')

In [23]:
chicago[startswithwater].head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER Management,90744.0
671,"Ander, Perry A",Water Chemist Ii,WATER Management,82044.0
1054,"Ashley, Karma T",Water Chemist Ii,WATER Management,82044.0
1079,"Atkins, Joanna M",Water Chemist Ii,WATER Management,82044.0
1181,"Azeem, Mohammed A",Water Chemist Ii,WATER Management,53172.0

In [24]:
ist=chicago['Position Title'].str.lower().str.endswith('ist')
chicago[ist].head()

,Name,Position Title,Department,Employee Annual Salary
184,"Afroz, Nayyar",Psychiatrist,HEALTH,99840.0
308,"Alarcon, Luis J",Loan Processing Specialist,COMMUNITY DEVELOPMENT,81948.0
422,"Allain, Carolyn",Senior Telecommunications Specialist,DoIT,89880.0
472,"Allen, Robert",Machinist,WATER Management,94328.0
705,"Anderson, Edward M",Sr Procurement Specialist,PROCUREMENT,91476.0

### Strip Methods

In [25]:
chicago['Department'] = chicago['Department'].str.title()

In [26]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,Water Management,90744.0
1,"Aaron, Jeffery M",Police Officer,Police,84450.0
2,"Aaron, Karina",Police Officer,Police,84450.0
3,"Aaron, Kimberlei R",Chief Contract Expediter,General Services,89880.0
4,"Abad Jr, Vicente M",Civil Engineer Iv,Water Management,106836.0

In [27]:
"    Hello World    ".lstrip()

'Hello World    '

In [28]:
"    Hello World    ".rstrip()

'    Hello World'

In [29]:
"    Hello World    ".strip()

'Hello World'

In [30]:
chicago['Name']=chicago['Name'].str.strip()

In [31]:
chicago['Position Title'] = chicago['Position Title'].str.strip()

In [32]:
chicago.set_index('Name',inplace=True)

In [33]:
chicago.index

Index(['Aaron,  Elvia J', 'Aaron,  Jeffery M', 'Aaron,  Karina',
       'Aaron,  Kimberlei R', 'Abad Jr,  Vicente M', 'Abarca,  Anabel',
       'Abarca,  Emmanuel', 'Abascal,  Reece E', 'Abbasi,  Christopher',
       'Abbatacola,  Robert J',
       ...
       'Zwit,  Jeffrey J', 'Zwolfer,  Matthew W', 'Zych,  Mateusz',
       'Zydek,  Bryan', 'Zygadlo,  John P', 'Zygadlo,  Michael J',
       'Zygowicz,  Peter J', 'Zymantas,  Mark E', 'Zyrkowski,  Carlo E',
       'Zyskowski,  Dariusz'],
      dtype='object', name='Name', length=32062)

In [34]:
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",Water Rate Taker,Water Management,90744.0
"Aaron, Jeffery M",Police Officer,Police,84450.0
"Aaron, Karina",Police Officer,Police,84450.0
"Aaron, Kimberlei R",Chief Contract Expediter,General Services,89880.0
"Abad Jr, Vicente M",Civil Engineer Iv,Water Management,106836.0

In [35]:
chicago.columns

Index(['Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [36]:
chicago.columns = chicago.columns.str.upper()

In [37]:
chicago.head(1)

                   POSITION TITLE        DEPARTMENT  EMPLOYEE ANNUAL SALARY
Name
Aaron,  Elvia J  Water Rate Taker  Water Management                 90744.0

### Split Strings by Characters with .str.split() Method

In [38]:
'Hello my name is Boris'.split(" ")

['Hello', 'my', 'name', 'is', 'Boris']

In [39]:
chicago = pd.read_csv('chicago.csv')

In [63]:
chicago['First Name']=chicago['Name'].str.split(',').str.get(1).str.title()

In [77]:
chicago['MI'] = chicago['First Name'].str.split().str.get(1)

In [78]:
chicago.head()
chicago['Last Name'] = chicago['Name'].str.split().str.get(0).str.title()

In [79]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name,MI
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,Elvia J,"Aaron,",J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,Jeffery M,"Aaron,",M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,Karina,"Aaron,",NaN
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,Kimberlei R,"Aaron,",R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,Vicente M,Abad,M

In [87]:
chicago['First Name'].str.split().head()

0        [Elvia, J]
1      [Jeffery, M]
2          [Karina]
3    [Kimberlei, R]
4      [Vicente, M]
Name: First Name, dtype: object

In [89]:
chicago['Last Name'] = chicago['Last Name'].str.replace(",","")

In [90]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name,MI
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,Elvia J,Aaron,J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,Jeffery M,Aaron,M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,Karina,Aaron,NaN
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,Kimberlei R,Aaron,R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,Vicente M,Abad,M

In [93]:
chicago = chicago[['First Name','Last Name','MI','Position Title','Department','Employee Annual Salary']]

In [94]:
chicago.head()

,First Name,Last Name,MI,Position Title,Department,Employee Annual Salary
0,Elvia J,Aaron,J,WATER RATE TAKER,WATER MGMNT,$90744.00
1,Jeffery M,Aaron,M,POLICE OFFICER,POLICE,$84450.00
2,Karina,Aaron,NaN,POLICE OFFICER,POLICE,$84450.00
3,Kimberlei R,Aaron,R,CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,Vicente M,Abad,M,CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [102]:
chicago2 = pd.read_csv('chicago.csv').dropna(how = 'all')

In [107]:
chicago2['First Name'] = chicago2['Name'].str.split(',').str.get(1).str.strip().str.split(" ").str.get(0)

### The Expand and n Parameters of the str.split() Method

In [109]:
chicago[chicago2['Name'].str.split(",", expand = True)

                    0              1
0               AARON        ELVIA J
1               AARON      JEFFERY M
2               AARON         KARINA
3               AARON    KIMBERLEI R
4             ABAD JR      VICENTE M
5              ABARCA         ANABEL
6              ABARCA       EMMANUEL
7             ABASCAL        REECE E
8              ABBASI    CHRISTOPHER
9          ABBATACOLA       ROBERT J
10        ABBATEMARCO        JAMES J
11             ABBATE        TERRY M
12             ABBOTT        BETTY L
13             ABBOTT       LYNISE M
14         ABBRUZZESE      WILLIAM J
15           ABDALLAH           ZAID
16          ABDELHADI      ABDALMAHD
17         ABDELLATIF         AREF R
18        ABDELMAJEID           AZIZ
19      ABDOLLAHZADEH            ALI
20        ABDUL-KARIM     MUHAMMAD A
21           ABDULLAH       DANIEL N
22           ABDULLAH          KEVIN
23           ABDULLAH      LAKENYA N
24           ABDULLAH       RASHAD J
25        ABDULSATTAR         MUDHAR
26       ABDUL-SHAKUR          TAHIR
27         ABDULWAHAB      ABUUBAIDA
28            ABEJERO        JASON V
29     ABERCROMBIE IV         EARL S
...               ...            ...
32032       ZUNIGA JR          JAMES
32033          ZUNIGA         JUAN M
32034          ZUNIGA          OSCAR
32035          ZUNIGA         RONALD
32036          ZUNIGA         THOMAS
32037          ZUNIGA        VICENTE
32038            ZUNO           ERIK
32039           ZUPAN         BILL M
32040        ZUPANCIC          KELLY
32041        ZURAWSKI        CAROL A
32042        ZURAWSKI        JEFFREY
32043        ZURAWSKI          MAC Z
32044        ZURAWSKI         MARY E
32045           ZUREK        FRANCIS
32046           ZUREK         MARY H
32047          ZURITA         ADRIEL
32048          ZVANJA         TINA M
32049    ZWARYCZ MANN        IRENE A
32050         ZWARYCZ       THOMAS J
32051        ZWIESLER        MATTHEW
32052            ZWIT      JEFFREY J
32053         ZWOLFER      MATTHEW W
32054            ZYCH        MATEUSZ
32055           ZYDEK          BRYAN
32056         ZYGADLO         JOHN P
32057         ZYGADLO      MICHAEL J
32058        ZYGOWICZ        PETER J
32059        ZYMANTAS         MARK E
32060       ZYRKOWSKI        CARLO E
32061       ZYSKOWSKI        DARIUSZ

[32062 rows x 2 columns]